Tinkoff/src/InformationRegisters/ЖурналОбмена/ЖурналОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОбмена</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.РезультатВыполненияЗапроса</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияОтвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийЗапрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>МетодЗапроса</name>
    <type>
      <types>CatalogRef.МетодыЗапросов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СервисAPI</name>
    <type>
      <types>CatalogRef.СервисыAPI</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tinkoff/src/Enums/РезультатВыполненияЗапроса/РезультатВыполненияЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатВыполненияЗапроса</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленоКОтправке</name>
  </enumValues>
</mdclass:Enum>

Tinkoff/src/InformationRegisters/ЖурналОбмена/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Период = ТекущаяДатаСеанса();
		Запись.РезультатВыполнения = Перечисления.РезультатВыполненияЗапроса.Ожидание;
		Запись.ДатаОкончания = Дата(1,1,1);
		Запись.ДатаОтправки = Дата(1,1,1);
		Запись.ТекстСообщения = "";
		Запись.ТекстСообщенияОтвет = "";
		Запись.ОписаниеОшибки = "";
		Запись.ИдентификаторЗапроса = Новый УникальныйИдентификатор();	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
